In [1]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
from selenium import webdriver
import time
from selenium.webdriver.common.keys import Keys
from selenium.webdriver.common.by import By
import numpy as np
import re

In [2]:
df= pd.read_csv('glassdoor2.csv')
df2=df
df3=df

In [3]:
df2

,Unnamed: 0,Company Name,Job Title,Location,Ratings,Salary,Links,Job Description
0,0,Telstra,Data Analyst,Bangalore,3.9,₹7L - ₹9L (Glassdoor Est.)30d+,https://www.glassdoor.co.in/partner/jobListing...,"[""At Arcadis we focus on attracting, retaining..."
1,1,Arcadis,Data Engineering Analyst,Hyderābād,3.9,₹24L - ₹31L (Glassdoor Est.)15d,https://www.glassdoor.co.in/partner/jobListing...,['Employment Type\nPermanent\nClosing Date\n30...
2,2,Exusia,Senior Data Analyst - Data Engineering/Analytics,Bangalore,3.9,₹13L - ₹28L (Employer Est.)Easy Apply30d+,https://www.glassdoor.co.in/partner/jobListing...,['Department: Sales and Delivery Team - Empowe...
3,3,Sweans Technologies Pvt Ltd,Research Analyst - Looking for Fresh Graduates,Calicut,3.9,₹28T (Employer Est.)Easy Apply5d,https://www.glassdoor.co.in/partner/jobListing...,['Work closely with UK and US clients in Holly...
4,4,24-7 Intouch,Data Analyst (Overnight),Hyderābād,3.9,₹3L - ₹4L (Glassdoor Est.)Easy Apply30d+,https://www.glassdoor.co.in/partner/jobListing...,['About 24-7 Intouch\n24-7 Intouch is a global...
...,...,...,...,...,...,...,...,...
925,925,TATA Consultancy Services Ltd.,Financial Analyst,Mumbai,3.5,₹2L - ₹4L (Glassdoor Est.)30d+,https://www.glassdoor.co.in/partner/jobListing...,"['Job Description\n', '', '', '\n', 'Qualifica..."
926,926,TMF Group,Data and Reporting Analyst,Noida,3.5,₹12L - ₹18L (Employer Est.)30d+,https://www.glassdoor.co.in/partner/jobListing...,"['Job Description :', '', '\n. Deadline orient..."
927,927,ANI Calls India Private Limited,Data Analyst / Modeler,Mumbai,3.5,₹7L - ₹16L (Employer Est.)30d+,https://www.glassdoor.co.in/partner/jobListing...,"[""Anicalls\n\nIndustry: IT\n\nTotal Positions:..."
928,928,ANI Calls India Private Limited,Data Analyst -WAKAD-Pune sal: 2LPA to 4LPA Exp...,Pune,3.8,₹1L - ₹4L (Employer Est.)30d+,https://www.glassdoor.co.in/partner/jobListing...,"[""About Client:\n\nWe're associated with US Fi..."
929,929,Genie Customer Management Services,Research Analyst - Mumbai,Mumbai,3.8,₹3L - ₹7L (Glassdoor Est.)30d+,https://www.glassdoor.co.in/partner/jobListing...,"[""Job Description :\n\nJob Description:\n\nJob..."

In [4]:
df3.replace('None', np.nan)

,Unnamed: 0,Company Name,Job Title,Location,Ratings,Salary,Links,Job Description
0,0,Telstra,Data Analyst,Bangalore,3.9,₹7L - ₹9L (Glassdoor Est.)30d+,https://www.glassdoor.co.in/partner/jobListing...,"[""At Arcadis we focus on attracting, retaining..."
1,1,Arcadis,Data Engineering Analyst,Hyderābād,3.9,₹24L - ₹31L (Glassdoor Est.)15d,https://www.glassdoor.co.in/partner/jobListing...,['Employment Type\nPermanent\nClosing Date\n30...
2,2,Exusia,Senior Data Analyst - Data Engineering/Analytics,Bangalore,3.9,₹13L - ₹28L (Employer Est.)Easy Apply30d+,https://www.glassdoor.co.in/partner/jobListing...,['Department: Sales and Delivery Team - Empowe...
3,3,Sweans Technologies Pvt Ltd,Research Analyst - Looking for Fresh Graduates,Calicut,3.9,₹28T (Employer Est.)Easy Apply5d,https://www.glassdoor.co.in/partner/jobListing...,['Work closely with UK and US clients in Holly...
4,4,24-7 Intouch,Data Analyst (Overnight),Hyderābād,3.9,₹3L - ₹4L (Glassdoor Est.)Easy Apply30d+,https://www.glassdoor.co.in/partner/jobListing...,['About 24-7 Intouch\n24-7 Intouch is a global...
...,...,...,...,...,...,...,...,...
925,925,TATA Consultancy Services Ltd.,Financial Analyst,Mumbai,3.5,₹2L - ₹4L (Glassdoor Est.)30d+,https://www.glassdoor.co.in/partner/jobListing...,"['Job Description\n', '', '', '\n', 'Qualifica..."
926,926,TMF Group,Data and Reporting Analyst,Noida,3.5,₹12L - ₹18L (Employer Est.)30d+,https://www.glassdoor.co.in/partner/jobListing...,"['Job Description :', '', '\n. Deadline orient..."
927,927,ANI Calls India Private Limited,Data Analyst / Modeler,Mumbai,3.5,₹7L - ₹16L (Employer Est.)30d+,https://www.glassdoor.co.in/partner/jobListing...,"[""Anicalls\n\nIndustry: IT\n\nTotal Positions:..."
928,928,ANI Calls India Private Limited,Data Analyst -WAKAD-Pune sal: 2LPA to 4LPA Exp...,Pune,3.8,₹1L - ₹4L (Employer Est.)30d+,https://www.glassdoor.co.in/partner/jobListing...,"[""About Client:\n\nWe're associated with US Fi..."
929,929,Genie Customer Management Services,Research Analyst - Mumbai,Mumbai,3.8,₹3L - ₹7L (Glassdoor Est.)30d+,https://www.glassdoor.co.in/partner/jobListing...,"[""Job Description :\n\nJob Description:\n\nJob..."

In [5]:
df3 = df3.dropna(subset=['Job Title'])

In [6]:
df3=df3.drop_duplicates()

In [7]:
df3.reset_index(drop=True, inplace=True)

In [8]:
df3.shape

(930, 8)

In [15]:
df3['Salary'].value_counts()

                93
5L - 7L ()      62
4L - 8L ()      62
3L - 7L ()      62
7L - 9L ()      31
4L - 6L ()      31
7L - 16L ()     31
12L - 18L ()    31
2L - 4L ()      31
8L - 14L ()     31
5L - 14L ()     31
9L - 14L ()     31
2L - 5L ()      31
5L - 6L ()      31
18T - 40T ()    31
12L - 16L ()    31
24L - 31L ()    31
3L - 10L ()     31
2L - 3L ()      31
12T - 15T ()    31
37T - 56T ()    31
3L - 4L ()      31
28T ()          31
13L - 28L ()    31
1L - 4L ()      31
Name: Salary, dtype: int64

In [14]:
df3['Salary'] = df3['Salary'].str.replace('\n', '')
df3['Salary'] = df3['Salary'].str.replace(',', '')
df3['Salary'] = df3['Salary'].str.replace('₹','')
df3['Salary'] = df3['Salary'].str.replace('(Employer Est.)','')
df3['Salary'] = df3['Salary'].str.replace('(Glassdoor Est.)','')
df3['Salary'] = df3['Salary'].str.replace('()','')
df3['Salary'] = df3['Salary'].str.replace('30d+','')
df3['Salary'] = df3['Salary'].str.replace('15d','')
df3['Salary'] = df3['Salary'].str.replace('4d','')
df3['Salary'] = df3['Salary'].str.replace('Easy Apply24h','')
df3['Salary'] = df3['Salary'].str.replace('Easy Apply7d','')
df3['Salary'] = df3['Salary'].str.replace('Easy Apply30d+','')
df3['Salary'] = df3['Salary'].str.replace('3d','')
df3['Salary'] = df3['Salary'].str.replace('Easy Apply6d','')
df3['Salary'] = df3['Salary'].str.replace('Easy Apply5d','')
df3['Salary'] = df3['Salary'].str.replace('Easy Apply+','')
df3['Salary'] = df3['Salary'].str.replace('+','')
df3['Salary'] = df3['Salary'].str.replace('5d','')

C:\Users\Kaveri\AppData\Local\Temp\ipykernel_4484\1015515654.py:4: FutureWarning: The default value of regex will change from True to False in a future version.
  df3['Salary'] = df3['Salary'].str.replace('(Employer Est.)','')
C:\Users\Kaveri\AppData\Local\Temp\ipykernel_4484\1015515654.py:5: FutureWarning: The default value of regex will change from True to False in a future version.
  df3['Salary'] = df3['Salary'].str.replace('(Glassdoor Est.)','')
C:\Users\Kaveri\AppData\Local\Temp\ipykernel_4484\1015515654.py:6: FutureWarning: The default value of regex will change from True to False in a future version.
  df3['Salary'] = df3['Salary'].str.replace('()','')
C:\Users\Kaveri\AppData\Local\Temp\ipykernel_4484\1015515654.py:7: FutureWarning: The default value of regex will change from True to False in a future version.
  df3['Salary'] = df3['Salary'].str.replace('30d+','')
C:\Users\Kaveri\AppData\Local\Temp\ipykernel_4484\1015515654.py:12: FutureWarning: The default value of regex will change from True to False in a future version.
  df3['Salary'] = df3['Salary'].str.replace('Easy Apply30d+','')
C:\Users\Kaveri\AppData\Local\Temp\ipykernel_4484\1015515654.py:16: FutureWarning: The default value of regex will change from True to False in a future version.
  df3['Salary'] = df3['Salary'].str.replace('Easy Apply+','')
C:\Users\Kaveri\AppData\Local\Temp\ipykernel_4484\1015515654.py:17: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df3['Salary'] = df3['Salary'].str.replace('+','')

In [16]:
df3['Salary'].value_counts()

                93
5L - 7L ()      62
4L - 8L ()      62
3L - 7L ()      62
7L - 9L ()      31
4L - 6L ()      31
7L - 16L ()     31
12L - 18L ()    31
2L - 4L ()      31
8L - 14L ()     31
5L - 14L ()     31
9L - 14L ()     31
2L - 5L ()      31
5L - 6L ()      31
18T - 40T ()    31
12L - 16L ()    31
24L - 31L ()    31
3L - 10L ()     31
2L - 3L ()      31
12T - 15T ()    31
37T - 56T ()    31
3L - 4L ()      31
28T ()          31
13L - 28L ()    31
1L - 4L ()      31
Name: Salary, dtype: int64

In [17]:
df3["salary_period"]=np.nan

In [18]:
import string
df3["Salary"].str.contains("year")
c=df3["Salary"]
i=0
for rows in c:
    
    if(type(rows)==str):
        if (rows.find("L")!=-1):
            df3["salary_period"][i]="year"
        
    i=i+1

C:\Users\Kaveri\AppData\Local\Temp\ipykernel_4484\1838717329.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3["salary_period"][i]="year"

In [19]:
df3["Salary"].str.contains("month")
c=df2["Salary"]
i=0
for rows in c:
    
    if(type(rows)==str):
        if (rows.find("T")!=-1):
            df3["salary_period"][i]="month"
    i=i+1

In [20]:
c=df3["Salary"]
i=0
for rows in c:
    
    if(type(rows)==str):
        if (rows.find("Hour")!=-1):
            df3["salary_period"][i]="hour"
    i=i+1

In [21]:
df3["salary_period"].value_counts()

year     713
month    124
Name: salary_period, dtype: int64

In [22]:
df3["Average"]=np.nan

In [23]:
df3['Salary2']=df3['Salary']

In [24]:
df3['Salary'] = df3['Salary'].str.replace('L','')
df3['Salary'] = df3['Salary'].str.replace('-','')
df3['Salary'] = df3['Salary'].str.replace('T','')

In [25]:
df3['Salary'].value_counts()

             93
5  7 ()      62
4  8 ()      62
3  7 ()      62
7  9 ()      31
4  6 ()      31
7  16 ()     31
12  18 ()    31
2  4 ()      31
8  14 ()     31
5  14 ()     31
9  14 ()     31
2  5 ()      31
5  6 ()      31
18  40 ()    31
12  16 ()    31
24  31 ()    31
3  10 ()     31
2  3 ()      31
12  15 ()    31
37  56 ()    31
3  4 ()      31
28 ()        31
13  28 ()    31
1  4 ()      31
Name: Salary, dtype: int64

In [26]:
def avg(a,b):
    return (a+b)/2
c=df3["Salary"]

av=0
a=0
b=0
i=0
for rows in c:
    av=0
    if(type(rows)==str):
        rows=rows.split()
        for item in range(0,len(rows)):
            if(rows[item].isdigit()):
                
                av=av+1
                
    if(av==1):
                
        df3['Average'][i]=rows[0]
            
    i=i+1

C:\Users\Kaveri\AppData\Local\Temp\ipykernel_4484\1617094531.py:20: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['Average'][i]=rows[0]

In [27]:
def avg(a,b):
    return (a+b)/2
c=df3["Salary"]

av=0
a=0
b=0
i=0
for rows in c:
    if(type(rows)==str):
        rows=rows.split()
        for item in range(0,len(rows)):
            if(rows[item].isdigit() and rows[item+1].isdigit()):
                av=avg(int(rows[0]),int(rows[1]))
                df3["Average"][i]=av
    i=i+1

In [29]:
df3["Average"].value_counts()

6.0     124
5.0      93
3.5      62
11.5     62
2.5      62
8.0      31
3.0      31
11.0     31
9.5      31
5.5      31
14.0     31
6.5      31
29.0     31
27.5     31
13.5     31
46.5     31
28       31
20.5     31
15.0     31
Name: Average, dtype: int64

In [141]:
df3['Job Description']=df3['Job Description2']

In [138]:
cleaning_list = ['+','[',']',"'",'"', '$','/',',','?','.',';','-','@','!','&','%','^','*',')','(', '\n']
for item in cleaning_list:
    df3['Job Description2'] = df3['Job Description2'].str.replace(item, ' ')

C:\Users\Kaveri\AppData\Local\Temp\ipykernel_4484\263574843.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df3['Job Description2'] = df3['Job Description2'].str.replace(item, ' ')

In [139]:
df3['Job Description2']

0        At Arcadis we focus on attracting  retaining...
1        Employment Type\nPermanent\nClosing Date\n30...
2        Department: Sales and Delivery Team   Empowe...
3        Work closely with UK and US clients in Holly...
4        About 24 7 Intouch\n24 7 Intouch is a global...
                             ...
925      Job Description\n            \n    Qualifica...
926      Job Description :        \n  Deadline orient...
927      Anicalls\n\nIndustry: IT\n\nTotal Positions:...
928      About Client:\n\nWe re associated with US Fi...
929      Job Description :\n\nJob Description:\n\nJob...
Name: Job Description2, Length: 930, dtype: object

In [169]:
exp=[]

In [170]:
def desc(i):
    l = df3["Job Description"][i]
    l=str(l)
    p = l.split('\n')
    return p

In [171]:
for i in range(0,930):
    
    p=desc(i)
    for line in p:
        y = re.findall('\d+ .+ [Ee]xperience', line)
        if y!= []:
            exp.append(y)

In [172]:
exp2.shape

(510, 1)

In [180]:
exp2 = pd.DataFrame(exp)

In [199]:
df3['Years of Experience']=exp2

In [200]:
df3['Years of Experience']

0      365  Fulcrum  OpenGround  BIM360  SQL Server  ...
1      5   12 years    Basic Qualification: Master Ba...
2      24 7 Intouch\n24 7 Intouch is a global custome...
3      37 000 00   ₹55 600 00 per month    Applicatio...
4      35 WPM  and Computer LiteracyHighly organized ...
                             ...
925                                                  NaN
926                                                  NaN
927                                                  NaN
928                                                  NaN
929                                                  NaN
Name: Years of Experience, Length: 930, dtype: object

In [201]:
cleaning_list = ['+','[',']',"'",'"', '$','/',',','?','.',';','-','@','!','&','%','^','*',')','(', '\n']
for item in cleaning_list:
    df3['Years of Experience'] = df3['Years of Experience'].str.replace(item, ' ')

C:\Users\Kaveri\AppData\Local\Temp\ipykernel_4484\4028248349.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df3['Years of Experience'] = df3['Years of Experience'].str.replace(item, ' ')

In [202]:
c=df3['Years of Experience']
i=0
for rows in c:
    if(type(rows)==str):
        rows=rows.lower()
        rows=rows.split()
        a='year'
        b='years'
        c='experience'
        if( (a in rows or b in rows) and c in rows):
            pass
        else:
            df3['Years of Experience'][i]=None
    i=i+1

In [203]:
c=df3['Years of Experience']
i=0
d=0
k=[]
for rows in c:
    
    if(type(rows)==str):
        rows=rows.lower()
        rows=rows.split()
        
        a='years'
        c='year'
        b='experience'
        if (a in rows or c in rows) and b in rows:
            for t in range(0,len(rows)):
                if(rows[t].isdigit()):
                    if(int(rows[t])<19 and int(rows[t])>0 ):
                        df3['Years of Experience'][i]=rows[t]
                    else:
                        df3['Years of Experience'][i]=None
            
    i=i+1

In [204]:
df3['Years of Experience'].isna().sum()

713

In [205]:
df3['Years of Experience'].value_counts()

2     93
3     62
12    31
4     31
Name: Years of Experience, dtype: int64

In [83]:
df3.isna().sum()

Unnamed: 0               0
Company Name             0
Job Title                0
Location                 3
Ratings                 11
Salary                   0
 Links                   0
Job Description          0
salary_period           93
Average                 93
Salary2                  0
Job Description2         0
Years of Experience    750
Location                 0
dtype: int64

In [57]:
df3["Location"]=df3['Location ']

In [124]:
df3['Location'].value_counts()

Mumbai                341
Bangalore             155
Hyderābād             124
New Delhi              62
Noida                  62
India                  34
Lucknow                31
Remote                 31
Thiruvananthapuram     31
Pune                   31
Calicut                28
Name: Location, dtype: int64

In [81]:
c=df3['Location']
i=0
k=0
for rows in c:
    if (type(rows)==float):
        c[i]='India'
    i=i+1
print(k)

0

C:\Users\Kaveri\AppData\Local\Temp\ipykernel_4484\199980110.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  c[i]='India'

In [165]:
df3['Ratings'].value_counts()

3.8    387
3.5    226
3.9    207
3       22
4.5     22
4       22
2.5     22
3.7     22
Name: Ratings, dtype: int64

In [166]:
df3['Ratings'].isna().sum()

0

In [103]:
l=[]

In [111]:
l=[]
c=df3['Ratings']
i=0
s=0
a=0

for i in range(0,len(df3['Ratings'])):
    if(type(df3['Ratings'][i])== str and df3['Ratings'][i]!= 'None'):
        l.append(df3['Ratings'][i])
        
print(l)

['3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.8', '3.5', '3.5', '3.5', '3', '4.5', '4', '3.8', '2.5', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.9', '3.5', '3.5', '3.5', '3.5', '3.5', '3.5', '3.8', '3.8']

In [113]:
a=0
s=0
i=0
for rows in l:
    s=s+float(rows)
    a=a+1
    i=i+1

In [114]:
s

3376.900000000031

In [115]:
a

908

In [116]:
avg = s/a

In [117]:
avg

3.7190528634361577

In [164]:
c=df3['Ratings']
i=0
s=0
c=0
for i in range(0,len(df3['Ratings'])):
    if(type(df3['Ratings'][i])==float):
        df3['Ratings'][i]=3.7

In [126]:
df3['Job Type']=np.nan

In [127]:
df3['Job Title'].value_counts()

Data Analyst                                                                                            155
Business Analyst                                                                                         62
Data Analysts                                                                                            31
Data Analyst -WAKAD-Pune sal: 2LPA to 4LPA Exp:0-3yrsAssociated with US Financial Investment clients     31
Data Analyst / Modeler                                                                                   31
Data and Reporting Analyst                                                                               31
Financial Analyst                                                                                        31
Data Analyst - SAS/SQL/Macros                                                                            31
Master Data Management Analyst                                                                           31
LTI Hiring- Data Analyst/ SQL                                                                            31
Analyst - Data & Analytics                                                                               31
Business Analyst (BA) - Banking - WFH                                                                    31
Looking for Fresher for Data Analyst Role - Mumbai, Ghatkopar                                            31
Hiring for Cibil - Data Analyst at Lower Parel/ Thane location.                                          31
Data Engineering Analyst                                                                                 31
Operations Analyst, Trilogy (Remote) - $30,000/year USD                                                  31
Product Security Analyst                                                                                 31
Reporting Analyst                                                                                        31
Project Business Analyst                                                                                 31
Data Analyst_Web Research                                                                                31
Analyst                                                                                                  31
Data Analyst (Overnight)                                                                                 31
Research Analyst - Looking for Fresh Graduates                                                           31
Senior Data Analyst - Data Engineering/Analytics                                                         31
Research Analyst - Mumbai                                                                                31
Name: Job Title, dtype: int64

In [130]:
c=df3["Job Title"]
i=0
for rows in c:
    if(type(rows)==str):
        rows=rows.lower()
        rows=rows.split()
        
        
        
        e='(overnight)'
            
        if e in rows:
            
            df3["Job Type"][i] = "Night Shift"
        else:
            df3["Job Type"][i] = "Full time"
    i=i+1

In [131]:
df3['Job Type'].value_counts()

Full time      899
Night Shift     31
Name: Job Type, dtype: int64

In [142]:
df3

,Unnamed: 0,Company Name,Job Title,Location,Ratings,salary_period,Average,Job Description2,Years of Experience,Location,Job Type,Job Description
0,0,Telstra,Data Analyst,Bangalore,3.9,year,8.0,At Arcadis we focus on attracting retaining...,None,Bangalore,Full time,At Arcadis we focus on attracting retaining...
1,1,Arcadis,Data Engineering Analyst,Hyderābād,3.9,year,27.5,Employment Type\nPermanent\nClosing Date\n30...,None,Hyderābād,Full time,Employment Type\nPermanent\nClosing Date\n30...
2,2,Exusia,Senior Data Analyst - Data Engineering/Analytics,Bangalore,3.9,year,20.5,Department: Sales and Delivery Team Empowe...,3,Bangalore,Full time,Department: Sales and Delivery Team Empowe...
3,3,Sweans Technologies Pvt Ltd,Research Analyst - Looking for Fresh Graduates,Calicut,3.9,month,28,Work closely with UK and US clients in Holly...,None,Calicut,Full time,Work closely with UK and US clients in Holly...
4,4,24-7 Intouch,Data Analyst (Overnight),Hyderābād,3.9,year,3.5,About 24 7 Intouch\n24 7 Intouch is a global...,None,Hyderābād,Night Shift,About 24 7 Intouch\n24 7 Intouch is a global...
...,...,...,...,...,...,...,...,...,...,...,...,...
925,925,TATA Consultancy Services Ltd.,Financial Analyst,Mumbai,3.5,year,3.0,Job Description\n \n Qualifica...,NaN,Mumbai,Full time,Job Description\n \n Qualifica...
926,926,TMF Group,Data and Reporting Analyst,Noida,3.5,year,15.0,Job Description : \n Deadline orient...,NaN,Noida,Full time,Job Description : \n Deadline orient...
927,927,ANI Calls India Private Limited,Data Analyst / Modeler,Mumbai,3.5,year,11.5,Anicalls\n\nIndustry: IT\n\nTotal Positions:...,NaN,Mumbai,Full time,Anicalls\n\nIndustry: IT\n\nTotal Positions:...
928,928,ANI Calls India Private Limited,Data Analyst -WAKAD-Pune sal: 2LPA to 4LPA Exp...,Pune,3.8,year,2.5,About Client:\n\nWe re associated with US Fi...,NaN,Pune,Full time,About Client:\n\nWe re associated with US Fi...
929,929,Genie Customer Management Services,Research Analyst - Mumbai,Mumbai,3.8,year,5.0,Job Description :\n\nJob Description:\n\nJob...,NaN,Mumbai,Full time,Job Description :\n\nJob Description:\n\nJob...

In [147]:
df3=df3.drop(['Location '],axis=1)

In [148]:
df3

,Company Name,Job Title,Ratings,salary_period,Average,Years of Experience,Location,Job Type,Job Description
0,Telstra,Data Analyst,3.9,year,8.0,None,Bangalore,Full time,At Arcadis we focus on attracting retaining...
1,Arcadis,Data Engineering Analyst,3.9,year,27.5,None,Hyderābād,Full time,Employment Type\nPermanent\nClosing Date\n30...
2,Exusia,Senior Data Analyst - Data Engineering/Analytics,3.9,year,20.5,3,Bangalore,Full time,Department: Sales and Delivery Team Empowe...
3,Sweans Technologies Pvt Ltd,Research Analyst - Looking for Fresh Graduates,3.9,month,28,None,Calicut,Full time,Work closely with UK and US clients in Holly...
4,24-7 Intouch,Data Analyst (Overnight),3.9,year,3.5,None,Hyderābād,Night Shift,About 24 7 Intouch\n24 7 Intouch is a global...
...,...,...,...,...,...,...,...,...,...
925,TATA Consultancy Services Ltd.,Financial Analyst,3.5,year,3.0,NaN,Mumbai,Full time,Job Description\n \n Qualifica...
926,TMF Group,Data and Reporting Analyst,3.5,year,15.0,NaN,Noida,Full time,Job Description : \n Deadline orient...
927,ANI Calls India Private Limited,Data Analyst / Modeler,3.5,year,11.5,NaN,Mumbai,Full time,Anicalls\n\nIndustry: IT\n\nTotal Positions:...
928,ANI Calls India Private Limited,Data Analyst -WAKAD-Pune sal: 2LPA to 4LPA Exp...,3.8,year,2.5,NaN,Pune,Full time,About Client:\n\nWe re associated with US Fi...
929,Genie Customer Management Services,Research Analyst - Mumbai,3.8,year,5.0,NaN,Mumbai,Full time,Job Description :\n\nJob Description:\n\nJob...

In [133]:
df3=df3.drop([' Links'],axis=1)

In [206]:
df3.isna().sum()

Company Name             0
Job Title                0
Ratings                  0
salary_period           93
Average                 93
Years of Experience    713
Location                 0
Job Type                 0
Job Description          0
dtype: int64

In [188]:
df3=df3.drop(['Unnamed: 0'],axis=1)

In [200]:
c=df3['Job Description']
k=0
i=0
for rows in c:
    if(rows==None):
        print(rows)
    i=i+1

In [204]:
df3['Job Description'][856]

nan

In [205]:
df3.drop([856], axis=0, inplace=True)

In [208]:
df3['Years of Experience']

6    60
1    30
5    30
2    30
3    30
8    30
Name: Years of Experience, dtype: int64

In [209]:
df3['Job Title'].value_counts()

Data Scientist                                                            239
Data Science Intern                                                        60
Associate Data Scientist                                                   60
Data scientist                                                             60
Data Science                                                               30
Data Scientist/Machine Learning                                            30
Manager – Data Analytics & Scientific Computing @ L'Oreal, R&I, Mumbai     30
Data Scientist - Data Science                                              30
Associate Data Science Analyst                                             30
Artificial Intelligence Internship                                         30
DATA SCIENTIST                                                             30
Data Analytics                                                             30
Junior Data Scientist Mentor                                               30
Senior Analyst- Research & Insights- Data Science, Data Analyst            30
Experimentation Data Scientist - Chase                                     30
Data scientist - Battery models                                            30
Machine Learning Engineer                                                  30
Data Scientist Intern                                                      30
Junior Data Scientist                                                      30
Sr. Data Scientist, Visa Consulting and Analytics                          30
Name: Job Title, dtype: int64

In [207]:
df3.to_csv('finalglassdoor2.csv')